# **Scaling using standardization**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('ds_salaries.csv')
df.head(1)

,id,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L

In [3]:
selected_columns = ['salary','salary_in_usd','remote_ratio']
df1 = df[selected_columns]
df1

     salary  salary_in_usd  remote_ratio
0     70000          79833             0
1    260000         260000             0
2     85000         109024            50
3     20000          20000             0
4    150000         150000            50
..      ...            ...           ...
602  154000         154000           100
603  126000         126000           100
604  129000         129000             0
605  150000         150000           100
606  200000         200000           100

[607 rows x 3 columns]

In [4]:
X = df1.drop('remote_ratio',axis=1)
Y = df1['remote_ratio']

In [5]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X,Y)

In [6]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

scaler.fit(X_train)

X_train_scaled = scaler.transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [7]:
scaler.mean_

array([379740.7978022 , 110690.47912088])